{
    "str001": "English",
    "str002": "Chinese",
    "str003": "Japanese",
    "str004": "Red",
    "str005": "Blue",
    "str006": "Green",
    "str007": "Yellow",
    "str008": "Orange",
    "str009": "Purple",
    "str010": "Xizhi District is a good place in New Taipei city. Keelung river split Xizhi, two highway and railway, drive or take train to anywhere is easily.",
    "str011": "In Xizhi dist., major industries is information and electronic technology, most popular 3C brands like Acer, Garmin headquarters build at Xizhi.",
    "str012": "If you travel to Taipei and take train to Jiufen or Keelung or sky lantern in Shifen, you will passing through Xizhi dist.",
    "str013": "Xike is a train station in Xizhi and service for all commuter of Xizhi Science and Technology Park. It is the biggest simple commute station in Taiwan, every day with 17000+ people take train here.",
    "str014": "This page use v-html to bind text with inside hyperlink tag.",
    "str015": "<h2>In Taiwan</h2>, if you want search <span style=\"color:green;font-weight:700;\">MRT and train</span> take time, you can use <a href=\"https://melixyen.github.io/railtime/\" target=\"_blank\">This Web App</a> to find starting / ending point transfer easily.",
    "str016": "Sure, If you want take bus or tell somebody bus stop information, you can find bus stop time with <a href=\"https://melixyen.github.io/railtime/busp.html\" target=\"_blank\">Bus smart stop creator</a> and make a smart link save in bookmark or share QR Code to other people.",
    "str017": "VueDuoGuo is a multi language solution for old ES5 web site. If you are only use Vue.js without Vuex, Vue-Router or other plugin, and string file load by HTML script src, you can easily use VueDuoGuo to control change language action.",
    "str018": "Inclue this file after Vue.js, call VueDuoGuo.setConfig function and send a config object. When user want change language, call Vue.duoguo.change(key), key is language value by your definition.",
    "str019": "DuoGuo mean multiple country in Chinese, usually refers to multi language in web design. So VueDuoGuo mean `Support multi language in Vue.js` and especially for ES5 developer, because many web site only upgrade from jQuery UI to Vue without Vuex to manage data store.",
    "str020": "Demo site of VueDuoGo.",
    "str021": "Now change to English page.",
    "str022": "This page use VueDuoGuo for HTML form.",
    "str023": "Please input something.",
    "str024": "HTML Select Option 1",
    "str025": "HTML Select Option 2",
    "str026": "HTML Select Option 3",
    "str027": "some string in this page only with English version and without others, setConfig baseLang:xxx will load English first and combine to main language.",
    "str028": "I only with English version, now you see me in an English word.",
    "str029": "I have multi language translated, so now I am English.",
    "str030": "Sorry maybe the translator forgot me last night.",
    "str031": "Do you know what is baseLang now ?",
    "str032": "This site help you to check every component change language by click 3 top buttons. The color box also can be clicked, you can see more language change action.",
    "str033": "This page use {type} format string."
}